glcloud/keil_v5/ARM/PACK/.Web/Keil.S32K118_SDK_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexCAN"       Cversion="1.0.0" condition="S32K DRV_FlexCAN">
      <description>FlexCAN Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXCAN
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexcan__driver.html"/>
        <file category="header" name="platform/drivers/inc/flexcan_driver.h"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_driver.c"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_hw_access.c"/>
        <file category="source" name="platform/drivers/src/flexcan/flexcan_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"        Cversion="1.0.0" condition="S32K DRV_FlexIO">
      <description>FlexIO Common Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexio__drv.html"/>
        <file category="header" name="platform/drivers/inc/flexio.h"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2C)"  Cversion="1.0.0" condition="S32K DRV_FlexIO_I2C">
      <description>FlexIO I2C Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2C
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexio__i2c__drv.html"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_i2c_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (I2S)"  Cversion="1.0.0" condition="S32K DRV_FlexIO_I2S">
      <description>FlexIO I2S Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2S
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexio__i2s__drv.html"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_i2s_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (SPI)"  Cversion="1.0.0" condition="S32K DRV_FlexIO_SPI">
      <description>FlexIO SPI Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_SPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexio__spi__drv.html"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_spi_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (UART)" Cversion="1.0.0" condition="S32K DRV_FlexIO_UART">
      <description>FlexIO UART Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_UART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__flexio__uart__drv.html"/>
        <file category="source" name="platform/drivers/src/flexio/flexio_uart_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM"           Cversion="1.0.0" condition="S32K DRV_FTM">
      <description>FTM Common Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM
      </RTE_Components_h>
      <files>
        <file category="doc"     name="doc/html/group__ftm__common.html"/>
        <file category="header"  name="platform/drivers/inc/ftm_common.h"/>
        <file category="source"  name="platform/drivers/src/ftm/ftm_common.c"/>
        <file category="source"  name="platform/drivers/src/ftm/ftm_hw_access.c"/>
        <file category="include" name="platform/drivers/src/ftm/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (IC)"      Cversion="1.0.0" condition="S32K DRV_FTM_IC">
      <description>FTM Input Capture Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_IC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ftm__ic__driver.html"/>
        <file category="header" name="platform/drivers/inc/ftm_ic_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_ic_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (MC)"      Cversion="1.0.0" condition="S32K DRV_FTM_MC">
      <description>FTM Module Counter Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_MC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ftm__mc__driver.html"/>
        <file category="header" name="platform/drivers/inc/ftm_mc_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_mc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (OC)"      Cversion="1.0.0" condition="S32K DRV_FTM_OC">
      <description>FTM Output Compare Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_OC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ftm__oc__driver.html"/>
        <file category="header" name="platform/drivers/inc/ftm_oc_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_oc_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (PWM)"     Cversion="1.0.0" condition="S32K DRV_FTM_PWM">
      <description>FTM Pulse Width Modulation Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_PWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ftm__pwm__driver.html"/>
        <file category="header" name="platform/drivers/inc/ftm_pwm_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_pwm_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="FTM (QD)"      Cversion="1.0.0" condition="S32K DRV_FTM_QD">
      <description>FTM Quadrature Decoder Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM_QD
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__ftm__qd__driver.html"/>
        <file category="header" name="platform/drivers/inc/ftm_qd_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/ftm_qd_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"     Cversion="1.0.0" condition="S32K">
      <description>Interrupt Manager (Interrupt)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_INTERRUPT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__interrupt__manager.html"/>
        <file category="header" name="platform/drivers/inc/interrupt_manager.h"/>
        <file category="source" name="platform/drivers/src/interrupt/interrupt_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LIN (LPUART)"  Cversion="1.0.0" condition="S32K DRV_LIN">
      <description>LIN Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LIN
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lin__driver.html"/>
        <file category="header" name="platform/drivers/inc/lin_driver.h"/>
        <file category="source" name="platform/drivers/src/lin/lin_common.c"/>
        <file category="source" name="platform/drivers/src/lin/lin_driver.c"/>
        <file category="source" name="platform/drivers/src/lin/lin_irq.c"/>

        <file category="include" name="platform/drivers/src/lpuart/"/>
        <file category="source" name="platform/drivers/src/lpuart/lin_lpuart_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPI2C"         Cversion="1.0.0" condition="S32K DRV_LPI2C">
      <description>LPI2C Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPI2C
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lpi2c__drv.html"/>
        <file category="header" name="platform/drivers/inc/lpi2c_driver.h"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_driver.c"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_hw_access.c"/>
        <file category="source" name="platform/drivers/src/lpi2c/lpi2c_irq.c"/>
      </files>
    </component>
